Revit 2026 API

# ReinforcementAbbreviationObjectType Enumeration

---

Defines the type of desired reinforcement object for abbreviation tags.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ReinforcementAbbreviationObjectType
```
```vb
Public Enumeration ReinforcementAbbreviationObjectType
```
```cpp
public enum class ReinforcementAbbreviationObjectType
```
```fsharp
type ReinforcementAbbreviationObjectType
```

| Member name | Value | Description |
| --- | --- | --- |
| Area | 0 | Abbreviation tags for Area Reinforcement. |
| Path | 1 | Abbreviation tags for Path Reinforcement. |

#### Reference

Autodesk.Revit.DB.Structure Namespace